Revit 2027 API
BuiltInFailures.RebarSystemFailures.CannotPlacePathReinforcementWarn Property
 Can't find a host for Path Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlacePathReinforcementWarn { get; }
Public Shared ReadOnly Property CannotPlacePathReinforcementWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlacePathReinforcementWarn {
	FailureDefinitionId^ get ();
}
static member CannotPlacePathReinforcementWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace